insert into blog.posts
(id, is_active, moderation_status, moderator_id, user_id, timestamp, title, text, view_count)
values (1, 1, "ACCEPTED", NULL, 1, now(), "Делаем копию карты-пропуска по фото", "Однажды мне срочно понадобилось попасть в один бизнес-центр с пропускной системой в виде турникетов, открывающихся при помощи карт-пропусков. Человек, у которого находился в этот момент пропуск, был далеко, передать мне его он не мог, а оформление новой карты в силу бюрократических особенностей заняло бы много времени.", 0);

insert into blog.posts
(id, is_active, moderation_status, moderator_id, user_id, timestamp, title, text, view_count)
values (2, 1, "ACCEPTED", NULL, 1, now(), "Самый мощный сервер Supermicro в Москве на основе AMD Epyc", "Однажды мне срочно понадобилось попасть в один бизнес-центр с пропускной системой в виде турникетов, открывающихся при помощи карт-пропусков. Человек, у которого находился в этот момент пропуск, был далеко, передать мне его он не мог, а оформление новой карты в силу бюрократических особенностей заняло бы много времени.", 0);

insert into blog.posts
(id, is_active, moderation_status, moderator_id, user_id, timestamp, title, text, view_count)
values (3, 0, "ACCEPTED", NULL, 1, now(), "Как проверить, находится ли дата в определенном диапазоне?", "У меня есть ряд диапазонов с датами начала и окончания. Я хочу проверить, находится ли дата в этом диапазоне. Date.before () и Date.after () кажутся немного неудобными в использовании. Что мне действительно нужно, так это что-то вроде этого псевдокода", 0);

insert into blog.posts
(id, is_active, moderation_status, moderator_id, user_id, timestamp, title, text, view_count)
values (4, 1, "NEW", 2, 1, now(), "Существуют две основные трактовки понятия «текст»", "Текст (от лат. textus — ткань; сплетение, сочетание) — зафиксированная на каком-либо материальном носителе человеческая мысль; в общем плане связная и полная последовательность символов. Существуют две основные трактовки понятия «текст»: имманентная (расширенная, философски нагруженная) и репрезентативная (более частная). Имманентный подход подразумевает отношение к тексту как к автономной реальности, нацеленность на выявление его внутренней структуры. Репрезентативный — рассмотрение текста как особой формы представления информации о внешней тексту действительности. В лингвистике термин «текст» используется в широком значении, включая и образцы устной речи. Восприятие текста изучается в рамках лингвистики текста и психолингвистики. Так, например, И. Р. Гальперин определяет текст следующим образом: «Это письменное сообщение, объективированное в виде письменного документа, состоящее из ряда высказываний, объединённых разными типами лексической, грамматической и логической связи, имеющее определённый моральный характер, прагматическую установку и соответственно литературно обработанное»[1].", 0);

insert into blog.posts
(id, is_active, moderation_status, moderator_id, user_id, timestamp, title, text, view_count)
values (5, 1, "ACCEPTED", NULL, 1, now() - 10000000000, "Биржа копирайтинга Text.ru", "Биржа копирайтинга Text.ru — это достойный заработок для копирайтеров и возможность заказать текст у профессиональных авторов. Здесь вы можете реализовать свой творческий потенциал или приобрести уникальные статьи для нужд своего сайта.", 0);

insert into blog.posts
(id, is_active, moderation_status, moderator_id, user_id, timestamp, title, text, view_count)
values (6, 1, "DECLINED", 2, 1, now(), "Пост не прошедший модерацию»", "Пост непрошедший модерацию это всегда грустно. в общем плане связная и полная последовательность символов. Существуют две основные трактовки понятия «текст»: имманентная (расширенная, философски нагруженная) и репрезентативная (более частная). Имманентный подход подразумевает отношение к тексту как к автономной реальности, нацеленность на выявление его внутренней структуры. Репрезентативный — рассмотрение текста как особой формы представления информации о внешней тексту действительности. В лингвистике термин «текст» используется в широком значении, включая и образцы устной речи. Восприятие текста изучается в рамках лингвистики текста и психолингвистики. Так, например, И. Р. Гальперин определяет текст следующим образом: «Это письменное сообщение, объективированное в виде письменного документа, состоящее из ряда высказываний, объединённых разными типами лексической, грамматической и логической связи, имеющее определённый моральный характер, прагматическую установку и соответственно литературно обработанное»[1].", 0);
